import discord
from discord.ext import commands

intents = discord.Intents.default()
intents.message_content = True

bot = commands.Bot(command_prefix='!', intents=intents)

@bot.event
async def on_ready():
    print(f'We have logged in as {bot.user}')

@bot.command()
async def check(ctx):
    await ctx.send("Я здесь")

@bot.command()
async def infoSite(ctx):
    await ctx.send("Для перехода на сайт нажмите [сюда](https://musor24.com/about/article/metodi-pererabotki-musora/)")

@bot.command()
async def whatCanIDo(ctx):
    await ctx.send("1. Что я могу сделать для этого?\n2. Чаще пользоваться общественным транспортом\n3. Экономить энергию\n4. Сократить потребление мяса\n5. Утилизировать отходы, использовать вторсырье, даже воду\n6. Информировать и обучать")

@bot.command()
async def howControlThis(ctx):
    await ctx.send("""1. Замените свет
Замена одной обычной лампочки на компактную люминесцентную лампочку сэкономит 150 фунтов углекислого газа в год.

2. Перерабатывайте больше.
Вы можете сэкономить 2400 фунтов углекислого газа в год, перерабатывая только половину бытовых отходов.

3. Проверьте свои шины.
Правильное поддержание давления в шинах может сократить расход бензина более чем на 3 процента. Каждый галлон сэкономленного бензина удерживает 20 фунтов углекислого газа в атмосфере.

4. Используйте меньше горячей воды
Для нагрева воды требуется много энергии. Используйте меньше горячей воды, принимая более короткий и прохладный душ и стирая одежду в холодной или теплой воде вместо горячей (экономия более 500 фунтов углекислого газа в год).

5. Избегайте продуктов с большим количеством упаковки.
Вы можете сэкономить 1200 фунтов углекислого газа, если сократите количество мусора на 10 процентов.

6. Отрегулируйте термостат.
Перемещение термостата вниз всего на 2 градуса зимой и вверх на 2 градуса летом может сэкономить около 2000 фунтов углекислого газа в год.

7. Посадите дерево
Одно дерево за свою жизнь поглотит одну тонну углекислого газа.

8. Выключайте электронные устройства.
Простое выключение телевизора, DVD-плеера, стереосистемы и компьютера, когда вы ими не пользуетесь, сэкономит вам тысячи фунтов углекислого газа в год.""")

@bot.command()
async def helpWithCom(ctx):
    await ctx.send("Команды: infoSite - даёт ссылку на сайт с методами переработки мусора; whatCanIDo - что ты можешь сделать для решения этой проблемы; howControlThis - как контролировать безопасноть экологии")


bot.run("Your Token")
